local M = {}
-- 🧶 🧵 🗒︎ 📄 📃 📑 📝 🫙 👻  🔭 🚆 🏗︎ 🚧 🪵 🗑️ 🗄️ 🗞️ 🧵 📇 📡 🔎 🔍️ 👣 🏷️ 📐 👀
-- 💯 ❌ 🗓️ 🤕 😦 🤔 😐 😺 😾 😿 🙀 🐛 😢 👣 🎃 🎵 📻 🕹️ 📺 ☕ 🗃️ 🔬
-- 📎 👻  🔔 🤖 🚑 ☕ 💦 ☔ ⚙️ 🛠️ 🛒 🚨 ⚠️ 🔦 🧪 🧫 🥼 ➗ ✖️ 🧨 🟰 ✔️ ❕ ❔ ❗️❓️ 🗜️
-- 🥬 🍂 🧰 🩺 🔮
--

--                                
--                                       
--                               
--                                      
--                         
--                                            
--                                         
--                      
--                        
--                              
--                                         
--               懶喇奈      
--          練練     ◩    ﳠ      ƒ 
--                                                

M.icons1 = {
	Class = " ",
	Color = " ",
	Constant = " ",
	Constructor = " ",
	Enum = "了 ",
	EnumMember = " ",
	Field = " ",
	File = " ",
	Folder = " ",
	Function = " ",
	Interface = "ﰮ ",
	Keyword = " ",
	Method = "ƒ ",
	Module = " ",
	Property = " ",
	Snippet = "﬌ ",
	Struct = " ",
	Text = " ",
	Unit = " ",
	Value = " ",
	Variable = " ",
}

M.icons2 = {
	File = " ",
	Module = " ",
	Namespace = " ",
	Package = " ",
	Class = " ",
	Method = " ",
	Property = " ",
	Field = " ",
	Constructor = " ",
	Enum = "練",
	Interface = "練",
	Function = " ",
	Variable = " ",
	Constant = " ",
	String = " ",
	Number = " ",
	Boolean = " ",
	Array = " ",
	Object = " ",
	Key = " ",
	Null = "ﳠ ",
	EnumMember = " ",
	Struct = " ",
	Event = " ",
	Operator = " ",
	-- TypeParameter = " ",
	TypeParameter = " ",
}
M.icons3 = {
	File = " ",
	Module = " ",
	Namespace = " ",
	Package = " ",
	Class = " ",
	Method = " ",
	Property = " ",
	Field = " ",
	Constructor = " ",
	Enum = "練",
	Interface = " ",
	Function = " ",
	Variable = " ",
	Constant = " ",
	String = " ",
	Number = " ",
	Boolean = " ",
	Array = " ",
	Object = " ",
	Key = " ",
	Null = "ﳠ ",
	EnumMember = " ",
	Struct = " ",
	Event = " ",
	Operator = " ",
	-- TypeParameter = " ",
	TypeParameter = " ",
}
M.kind_icons1 = {
	Text = "",
	Method = "ƒ",
	Function = "",
	Constructor = "",
	Field = "",
	Variable = "",
	Class = "ﴯ",
	Interface = "",
	Module = "",
	Property = "ﰠ",
	Unit = "",
	Value = "",
	Enum = "",
	Keyword = "",
	Snippet = "",
	Color = "",
	File = "",
	Reference = "",
	Folder = "",
	EnumMember = "",
	Constant = "",
	Struct = "",
	Event = "",
	Operator = "",
	TypeParameter = "",
}
M.kind_icons2 = {
	Text = "",
	Method = "",
	Function = "",
	Constructor = "",
	Field = "",
	Variable = "",
	Class = "ﴯ",
	Interface = "",
	Module = "",
	Property = "ﰠ",
	Unit = "",
	Value = "",
	Enum = "",
	Keyword = "",
	Snippet = "",
	Color = "",
	File = "",
	Reference = "",
	Folder = "",
	EnumMember = "",
	Constant = "",
	Struct = "",
	Event = "",
	Operator = "",
	TypeParameter = "",
}

M.emoji = {}
-- navic: icons3  cmp: kind_icon1
return M
